# Enade - Transformação de Dados - parte 01

In [1]:
# Importar as bibliotecas necessárias
import pandas as pd
import numpy as np
import os

In [52]:
enade = pd.read_csv(
    "./enade2019/microdados_Enade_2019_LGPD/2. DADOS/microdados2019_arq5.txt",
    sep = ';', decimal=','
)

In [53]:
enade.head()

   NU_ANO  CO_CURSO TP_SEXO
0    2019      7492       F
1    2019      7712       F
2    2019      9264       F
3    2019     10516       F
4    2019     12570       F

In [54]:
# Verificando o schema da tabela
dict(enade.dtypes)

{'NU_ANO': dtype('int64'), 'CO_CURSO': dtype('int64'), 'TP_SEXO': dtype('O')}

In [47]:
# NT_GER
enade.NT_GER.describe()

AttributeError: 'DataFrame' object has no attribute 'NT_GER'

In [35]:
# Contar o número de nulos
enade.NT_GER.isnull().sum()

44195

In [42]:
# Quantidade relativa de nulos
enade.NT_GER.isnull().sum() / enade.shape[0]

0.10184822436798562

In [ ]:
# Acessando estatisticas descritivas da NOTA GERAL
# apenas para os alunos da região NORDESTE
enade.loc[
    enade.CO_REGIAO_CURSO == 2
]

In [50]:
# Filtrando apenas alunos entre 20 e 50 anos
enade.loc[
    (enade.NU_IDADE >= 20) & 
    (enade.NU_IDADE <= 50)
]

        NU_ANO  CO_CURSO  NU_IDADE
99        2019   1205625      20.0
100       2019    111094      20.0
101       2019    109418      20.0
102       2019    119882      20.0
103       2019   1177444      20.0
...        ...       ...       ...
429004    2019   1401595      50.0
429005    2019   1401595      50.0
429006    2019   1403882      50.0
429007    2019   1403882      50.0
429008    2019   1420312      50.0

[428910 rows x 3 columns]

In [57]:
# Tabela cruzada
# Contar quantos homens e mulheres
enade.TP_SEXO.value_counts() / enade.shape[0]

F    0.537497
M    0.462250
Name: TP_SEXO, dtype: float64